---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.BendFailures.NotBentMaskingRegion
source: html/6ba0feae-ffab-e82e-a551-52319aa7c65a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.BendFailures.NotBentMaskingRegion Property

While making curved beam type "[Type Name]" Masking Region elements were not created

## Syntax (C#)
```csharp
public static FailureDefinitionId NotBentMaskingRegion { get; }
```